{
    "questions": [
      {
        "question": "You can change clothes instantly anywhere",
        "but": "Your wardrobe can't change from now on."
      },
      {
        "question": "You can eat all your favorite foods without gaining weight",
        "but": "You can never eat dessert again."
      },
      {
        "question": "You can become the best player in your favorite sport",
        "but": "You have to practice 10 hours every day for the rest of your life."
      },
      {
        "question": "You can have a perfect memory and never forget anything",
        "but": "You can never learn anything new."
      },
      {
        "question": "You can have the ability to fly",
        "but": "You can never ride in a car or use any other means of transportation."
      },
      {
        "question": "You can travel to any place in the world for free",
        "but": "You can never travel with your friends or family."
      },
      {
        "question": "You can become a famous celebrity",
        "but": "You have to give up all your privacy and live in the public eye."
      },
      {
        "question": "You can have unlimited money",
        "but": "You can never spend it on yourself; you must donate all of it to charity."
      },
      {
        "question": "You can live forever and never age",
        "but": "You have to watch all your loved ones grow old and pass away."
      },
      {
        "question": "You can have the power to read minds",
        "but": "You can't control when you hear people's thoughts, and you hear everything they think."
      },
      {
        "question": "You can become the smartest person in the world",
        "but": "You lose all your creativity and artistic abilities."
      },
      {
        "question": "You can have the ability to teleport",
        "but": "You can only teleport to places you have never been before."
      },
      {
        "question": "You can have a perfect romantic partner who loves you unconditionally",
        "but": "You can never have any other friends or relationships."
      },
      {
        "question": "You can have the power of super strength",
        "but": "You have to use your strength to help others and can never use it for personal gain."
      },
      {
        "question": "You can have the ability to time travel",
        "but": "You can never change anything in the past or future."
      },
      {
        "question": "You can become a famous author",
        "but": "You can never write under your own name; you must use a pseudonym."
      },
      {
        "question": "You can have the power to heal any illness or injury",
        "but": "You have to take on the pain and suffering of the person you heal."
      },
      {
        "question": "You can have the ability to speak and understand all languages",
        "but": "You can never speak your native language again."
      },
      {
        "question": "You can have a perfect body with no health issues",
        "but": "You can never eat your favorite foods again."
      },
      {
        "question": "You can have the power to control the weather",
        "but": "You can only use it for the benefit of others and never for personal gain."
      },
      {
        "question": "You can have the ability to breathe underwater",
        "but": "You can never swim in a pool or any other man-made body of water."
      },
      {
        "question": "You can have a personal assistant who does all your tasks and chores",
        "but": "You can never do anything for yourself; you become completely dependent on them."
      },
      {
        "question": "You can have the power of invisibility",
        "but": "You can only use it when nobody else is around."
      },
      {
        "question": "You can have a pet that can talk and understand you",
        "but": "You can never have any other pets."
      },
      {
        "question": "You can have the ability to control minds",
        "but": "You have to use your power to manipulate people for the rest of your life."
      },
      {
        "question": "You can have a personal robot that does all your housework",
        "but": "You can never do any physical activities or exercise."
      },
      {
        "question": "You can have the power to bring any fictional character to life",
        "but": "They become real and live in the real world, causing chaos and disruption."
      },
      {
        "question": "You can have a never-ending supply of your favorite food",
        "but": "You can never eat anything else; you have to eat only that food for the rest of your life."
      },
      {
        "question": "You can have the power to control fire",
        "but": "You can never feel warmth or comfort from fire again."
      },
      {
        "question": "You can have the ability to communicate with animals",
        "but": "You can never have any human friends or relationships."
      },
      {
        "question": "You can have the power to stop time",
        "but": "You age twice as fast when time is stopped."
      },
      {
        "question": "You can have the ability to clone yourself",
        "but": "Each clone only lives for 24 hours and then disappears."
      },
      {
        "question": "You can have the power of super speed",
        "but": "You can never walk or move at a normal pace again."
      },
      {
        "question": "You can have the ability to speak to plants",
        "but": "You can never eat any plant-based foods again."
      },
      {
        "question": "You can have the power to control technology",
        "but": "You can never use any technology yourself; you have to rely on others for everything."
      },
      {
        "question": "You can have the ability to change your appearance at will",
        "but": "Nobody will ever recognize you, including your friends and family."
      },
      {
        "question": "You can have the power to bring peace to the world",
        "but": "You can never experience peace or happiness in your own life."
      },
      {
        "question": "You can have the ability to know the answer to any question",
        "but": "You can never ask any questions yourself."
      },
      {
        "question": "You can have the power to control animals",
        "but": "You can never have a pet or interact with animals in any other way."
      },
      {
        "question": "You can have the ability to control dreams and have lucid dreams every night",
        "but": "You can never have a good night's sleep again."
      },
      {
        "question": "You can have the power to bring back a deceased loved one",
        "but": "They come back as a ghost and can never interact with the physical world."
      },
      {
        "question": "You can have the ability to instantly learn any new skill or subject",
        "but": "You forget something else you already knew every time you learn something new."
      },
      {
        "question": "You can have the power to control gravity",
        "but": "You can never experience the sensation of weightlessness."
      },
      {
        "question": "You can have a personal spaceship and explore the universe",
        "but": "You can never set foot on Earth again."
      },
      {
        "question": "You can have the ability to speak and understand all animal languages",
        "but": "You can never have a conversation with another human being."
      },
      {
        "question": "You can have the power of telekinesis",
        "but": "You can only move objects that weigh less than a pound."
      },
      {
        "question": "You can have the ability to see the future",
        "but": "You can never change or alter the future in any way."
      },
      {
        "question": "You can have a personal time machine",
        "but": "You can only travel to the past and can never return to the present."
      },
      {
        "question": "You can have the power to control the elements (fire, water, air, earth)",
        "but": "You can never feel the natural elements (e.g., warmth from the sun, breeze on your skin)."
      },
      {
        "question": "You can have the ability to instantly heal any physical injury or illness",
        "but": "You can never experience physical pleasure or sensation again."
      },
      {
        "question": "You can have the power to control people's emotions",
        "but": "You have to experience all the emotions you manipulate in others."
      }
    ]
  }
  